{
  "手办化": "Use the nano-banana model to create a 1/7 scale commercialized figure of the character in the illustration, in a realistic style and environment. Place the figure on a computer desk, using a circular transparent acrylic base without any text. On the computer screen, display the ZBrush modeling process of the figure. Next to the computer screen, place a BANDAI-style toy packaging box printed with the original artwork.",
  "手办化2": "Use the nano-banana model to create a GK (Garage Kit) unpainted grey resin prototype figure. High detail sculpting, placed on a workbench with sculpting tools scattered around. Realistic photography style.",
  "Q版化": "Transform the character into a Nendoroid style Chibi figure. Big head, small body, cute proportions, 2.5 heads tall, smooth plastic texture, 3D rendering style, clean background, commercial product photography.",
  "痛屋化": "Transform the environment into a hardcore 'Itasha' style otaku room. Cover the walls with anime posters and tapestries. Fill shelves with manga, light novels, and figurines. Add a high-end gaming PC setup with RGB lighting. The atmosphere is cozy and cluttered, reflecting a passionate anime fan's bedroom. Realistic lighting.",
  "痛车化": "Transform the vehicle into an 'Itasha' car. Wrap the car body with high-quality anime character decals and colorful graphics. Parked in a Japanese street setting or car meet. Realistic reflection and automotive photography.",
  "cos化": "Realistic cosplay photography. A real person cosplaying the character, wearing detailed costume and wig, realistic skin texture, professional makeup, cinematic lighting, real world background suitable for the character.",
  "孤独的我": "A lonely atmosphere. The character sits alone on a park bench at night, dim street light, melancholic mood, cinematic shot, high quality.",
  "鬼图": "Horror style photography. Dark, grainy, distorted, eerie atmosphere, ghost-like appearance, supernatural phenomenon, found footage style.",
  "第三视角": "Third-person perspective shot. Showing the character from behind or over the shoulder, interacting with the world, wide angle lens, RPG game camera style.",
  "第一视角": "First-person perspective (POV). Seeing through the character's eyes or looking at hands interacting with objects, immersive view."
}